
## Plan Result (prod)




<pre><code>Plan: 4 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.local_redis_password[0]
  * module.em-icp-redis-cache[0].azurerm_private_endpoint.this[0]
  * module.em-icp-redis-cache[0].azurerm_redis_cache.redis
  * module.em-icp-redis-cache[0].azurerm_resource_group.cache-resourcegroup[0]
* Update
  * azurerm_private_endpoint.ped_web_pubsub_private_endpoint


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.local_redis_password[0] will be created
  + resource "azurerm_key_vault_secret" "local_redis_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/em-icp-prod/providers/Microsoft.KeyVault/vaults/em-icp-prod"
      + name                    = "redis-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_private_endpoint.ped_web_pubsub_private_endpoint will be updated in-place
  ~ resource "azurerm_private_endpoint" "ped_web_pubsub_private_endpoint" {
        id                            = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/privateEndpoints/em-icp-prod-privateendpoint"
        name                          = "em-icp-prod-privateendpoint"
      ~ tags                          = {
          - "application"  = "core" -> null
          - "builtFrom"    = "hmcts/aks-cft-deploy" -> null
          - "businessArea" = "CFT" -> null
          - "environment"  = "production" -> null
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.em-icp-redis-cache[0].azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "em-icp-redis-cache-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "em-icp-redis-cache-cache-prod"
      + subnet_id                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-prod/subnets/core-infra-subnet-2-prod"
      + tags                     = {
          + "application"         = "evidence-management"
          + "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "production"
          + "managedBy"           = "Evidence Management"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "em-icp-redis-cache-prod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.em-icp-redis-cache[0].azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + access_keys_authentication_enabled = true
      + capacity                           = 1
      + family                             = "P"
      + hostname                           = (known after apply)
      + id                                 = (known after apply)
      + location                           = "uksouth"
      + minimum_tls_version                = "1.2"
      + name                               = "em-icp-redis-cache-prod"
      + non_ssl_port_enabled               = false
      + port                               = (known after apply)
      + primary_access_key                 = (sensitive value)
      + primary_connection_string          = (sensitive value)
      + private_static_ip_address          = (known after apply)
      + public_network_access_enabled      = true
      + redis_version                      = "6"
      + replicas_per_master                = (known after apply)
      + replicas_per_primary               = (known after apply)
      + resource_group_name                = "em-icp-redis-cache-cache-prod"
      + secondary_access_key               = (sensitive value)
      + secondary_connection_string        = (sensitive value)
      + sku_name                           = "Premium"
      + ssl_port                           = (known after apply)
      + tags                               = {
          + "application"         = "evidence-management"
          + "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "production"
          + "managedBy"           = "Evidence Management"
        }

      + redis_configuration {
          + authentication_enabled          = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

  # module.em-icp-redis-cache[0].azurerm_resource_group.cache-resourcegroup[0] will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "em-icp-redis-cache-cache-prod"
      + tags     = {
          + "application"         = "evidence-management"
          + "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "production"
          + "managedBy"           = "Evidence Management"
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1458,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->